'''Ссылка на занятие'''

# Сложение и вывод данных
name_1 = input('введите текст')
name_2 = input('введите текст')
print('hello ' + (name_1 + name_2))

# Преобразование строковый тип в целое
name_1 = int(input('введите число '))
name_2 = int(input('введите число '))
print('а вот и результат ', name_1 + name_2)

firstname = input('Введите свое имя: ')  # здесь приводить к типу int не нужно
lastname = input('Введите свою фамилию: ')
print('Здравствуйте, ' + firstname + ' ' + lastname)  # не забудьте про пробел между словами
